'''Задача L. Три монеты

У Артемия есть бесконечное число монет, каждая из которых одного из трех номиналов.
Его интересует, какие суммы от 1 до N рублей он может набрать в свой кошелек,
если там заранее лежала монета величиной в 1 рубль.
Формат входных данных
Первая строка содержит число N — ограничение на суммарную стоимость монет в кошельке (1 ≤ N ≤ 10^18).
Вторая строка содержит три числа A, B и C, задающие достоинства типов монет (1 ≤ A, B, C ≤ 100000).
Формат выходных данных
Выведите единственное число — количество сумм, которые можно набрать в кошельке.
Замечание
В первом примере возможны следующие варианты:
1 = 1
1 + 4 = 5
1 + 7 = 8
1 + 4 + 4 = 9
1 + 9 = 10
1 + 4 + 7 = 12
1 + 4 + 4 + 4 = 13
1 + 4 + 9 = 14
1 + 7 + 7 = 15
Примеры данных
Пример 1
Ввод:
15
4 7 9
Вывод: 9'''

# Partial Solution 4 tests done

N = int(input())
A, B, C = map(int, input().split())

dp = dict()
dp[0]=0
dp[1]=0

# first pass dp
for x in range(2, C):
    dp[x] = round((N-x-1)// C)

# second pass dp    
for x in range(2, C):
    if x >= A:
        dp[x] = min(dp[x], dp[x-A])
    else:
        dp[x] = min(dp[x], dp[x-A+C]+1)

# third pass dp   
for x in range(2, C):
    if x >= B:
        dp[x] = min(dp[x], dp[x-B])
    else:
        dp[x] = min(dp[x], dp[x-B+C]+1)
        
count_of_sums = sum([round((N-x) /C)- dp[x] for x in range(C)])
    
print (count_of_sums)